package com.digitalsigma.hobrasul.Activity;

import android.graphics.Typeface;
import android.os.Bundle;
import android.support.annotation.Nullable;
import android.support.v7.app.AppCompatActivity;
import android.widget.TextView;

import com.digitalsigma.hobrasul.R;

import net.alhazmy13.catcho.library.Catcho;

/**
 * Created by user2 on 1/10/2017.
 */

public class CvActiviy extends AppCompatActivity {

    Typeface t1;

    TextView nashaaTxt,triptxt,nametxt;

    @Override
    protected void onCreate(@Nullable Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        Catcho.Builder(this)
                .activity(ContactActivity.class)
                .build();
        setContentView(R.layout.activity_cv_details);
        t1=Typeface.createFromAsset(getAssets(),"hacen.ttf");

        nashaaTxt= (TextView) findViewById(R.id.nashaa);
        triptxt= (TextView) findViewById(R.id.trip);
        nametxt= (TextView) findViewById(R.id.name);



        nametxt.setText("طارق الشيخ");
        nashaaTxt.setTypeface(t1);
        triptxt.setTypeface(t1);
        nametxt.setTypeface(t1);

     /*   triptxt.setText("بدأت رحلة الشيخ مع الدعوة المباركة إبّان الستينيات حين اشتد الصراع في نفسه بين ما تعوّد الشباب من ثقافة وحياة تعلن الإسلام اسماُ وتنكره واقعاً وبين ثقافة وحياة إسلامية يقرؤونها ولا يجدون صداها في واقعهم المشهود، كذلك حين اشتد الصراع في مصر بين النظام السياسي والجماعات الإسلامية الأصولية تتحسس طريقها على استحياءٍ بين صفوف الشباب ممن صدمه الواقع المرير.\n" +
                "كان العامل الأساسيّ الذي حسم الصراع في نفس الشيخ وفي الواقع المصري آنذاك هو محاكمة الأستاذ سيد قطب، ثم إعدامه من قِبل نظام الزعيم عبد الناصر عام 1966. حُسم الصراع في نفسه لصالح الدعوة المباركة، كما حُسم في الواقع المصريّ لصالح الدعوة كذلك كما يعرف ذلك من عايش حقبة السبعينيات في مصر، وهو أمر لا محل للتوسع فيه في هذا التعريف.\n" +
                "بدأت رحلة الدعوة المباركة، إذن، في منتصف الستينيات بنسخ كتب الأستاذ الشهيد سيد قطب باليد وتوزيعها بين طلاب الجامعة، ثم تدرجت بعدها وامتدت مساحة أربعين عاما في الزمان والعالم العربي وأوروبا وأمريكا في المكان، والله الهادي لما كان.\n" +
                "كانت القراءة هي النشاط الأساسي الذي يشغل الشيخ منذ صباه، ثم حين حدث ما حدث من حسم للصراع النفسيّ توجه الشيخ للقراءة في كل مجالات المعرفة الإنسانية، فولع بقراءة وحفظ الشعر العربيّ قديمه وحديثه، وطالع أمهات الكتب في التاريخ العالمي وفي التاريخ الإسلامي على السواء، وفي الفلسفة الغربية من يونانيها إلى حديثها، واطلع على العديد من الكتب في علم النفس والرياضيات، ثم اتجه إلى التخصص في دراسة العلوم الإسلامية، فالتحق بمعهد الدراسات الإسلامية بالزمالك وأمضى عامين تتلمذ فيهما على أيدي أكابر الشيوخ في مجالات شتى كالشيخ الباقورى في اللغة العربية، والدكتور محمود قاسم في تاريخ العلوم الإسلامية والدكتور حسن إبراهيم حسن في التاريخ الإسلاميّ، والدكتور غريب الجمال والدكتور محمود حلمي وغيرهم.\n" +
                "ثم بدأ الشيخ رحلته مع العلوم الإسلامية في أوائل السبعينيات، فقرأ أعمال شيخ الإسلام بن تيمية وبن القيم وتلاميذهما كابن عبد الهادي وبن رجب الحنبلي، ثم الشيخ محمد بن عبد الوهاب والإمام المودودي، وتعرف على التوحيد والإيمان وحدودهما. كما اطلع على أمهات كتب التاريخ وموسوعات الفقه المقارن وكتب الحديث وأصوله. كما قرأ ما دوّن الأستاذ سيد وغيره من أئمة العصر الحديث كالعلامة محمود محمد شاكر والإمام أحمد شاكر والدكتور محمد محمد حسين والإمام محمد بن صالح العثيمين والإمام عبد العزيز بن باز وغيرهم كثير من أهل الفضل والعلم.\n" +
                "ولكن الشيخ كان قلبه قد تعلق بحب علم أصول الفقه لما فيه من تناسب للطبيعة المنطقية الرياضية التي زرعها الله في فطرته، ولأن علم الأصول هو الذي يُصلح ما اعوجّ من مناهج النظر وأصول الاستدلال بفعل الثقافة الحديثة التي بدّلت قوالب النظر واستبدلت أصول الاستدلال. فقرأ الشيخ غالب ما دونته الإئمة في علم الأصول كأصول السرخسيّ وبن الحاجب وإحكام بن حزم وإحكام بن عبد السلام وموافقات الشاطبي والمستصفى والمنخول للغزالي والبرهان للجويني وإرشاد الفحول للشوكاني وغير ذلك من الكتب قديمها وحديثها، وهو ما اعتمد عليه بعد توفيق الله في تدوين كتابه في الأصول \"مفتاح الدخول إلى علم الأصول\".\n" +
                "وقد أُسعد الله الشيخ بمقابلة ومعاشرة العديد من مشايخ الدعوة المباركة فصاحب منهم من صاحب وتتلمذ على يد من تتلمذ، وانتفع بهذا وبذاك أيما انتفاع فجزى الله أصحابه ورفاق طريقه خيرا كثيراً.\n" +
                "وقد صدر للشيخ العديد من الكتب التي غطت مساحة من العلوم الإسلامية كالعقيدة والفرق وأصول الفقه كما نشر عشرات من المقالات السياسية والدينية والأدبية في عدد من الصحف والدوريات كالمنار الجديد ومجلة البيان التي شارك بجهد في إصدارها بلندن في منتصف الثمانينيات من القرن المنصرم. كما أصدر الشيخ \"كتابا بالإنجليزية\" – \"فتنة أدعياء السلفية وانحرافاتهم\" - وقد ترجم كذلك للعربية. ونشر العديد من المقالات بالإنجليزية التي كان لها أثر كبير في مقاومة البدعة وخاصة الصوفية، وفي تنمية الحسّ السنيّ في تلك الناحية من العالم. كذلك فقد ترجم العديد من كتبه للغة الأردية ككتاب المعتزلة، والصوفية ومفتاح الدخول إلى علم الأصول، وحقيقة الإيمان، وذاعت في أوساط أهل السنة والجماعة في باكستان.\n" +
                "كما شارك الشيخ طارق عبد الحليم في عدة مؤتمرات بأمريكا وكندا ولكنه اختار العزلة بعد أن رأي ضعف الفائدة التي تعود على المسلمين من مثلها إلى جانب ضياع الوقت والمال.\n" +
                "وقد أنشأ الشيخ \"دار الأرقم\" بعد اسقراره في كندا في أواخر الثمانينيات، وبدأ تدريس دبلوم الشريعة الإسلامية بالتعاون مع \"الجامعة الإمريكية المفتوحة\" ومنح الدبلوما للعديد من الطلبة. كذلك أخرج مجلة \"أمة الإسلام\" في العربية والإنجليزية لعدة أعوام في تورونتو.\n" +
                "ولا يزال الشيخ يدعو ربه أن يفسح له في الأجل ليتم بعض ما عزم على إتمامه من عمل، ثم أن يتقبله منه خالصاً لوجههه بريئا من الرياء، مستقيماً على سنة نبيه . وهاكم بعض ما تفضلت به المنة الإلهية علي الشيخ من كتب ومقالات.\n");
*/


        nametxt.setText("سمسم شهاب");

        nashaaTxt.setText("سمسم شهاب او اسامة جابر هو فنان ومطرب شعبي مصري ولد بحي الوراق محافظة الجيزة عام 1971\n" +
                "بدأ مشوار الفني منذ أن كان عمرi 14 عام فقد أحب الغناء كثيرا،وكانت أسرته وبعض المقربين هم الذين يدعمونه دائما فى حياته للوصول الى عالم الأضواء والشهرة.\n" +
                "اول البوماته هو (بعدك ماليش ) وقد كان بعمر 24 عام ..  من اقرب اغانيه الي قلبه اغنية (عيشه الغلابه )والتى تعبر عن الفقراء . ومن أفضل الاغانى التى أحبها اغنيه (بيت العائله)في اخر البوماته والتى تخاطب الاسره المصريه.\n" +
                "من اشهر اغاني الفنان سمسم شهاب اغنية \"انا اللي كتير بلوم نفسي\" من كلمات الشاعر عماد عبيد ،والحان وليد عبد العظيم ،وتوزيع تامر صقر ، واخراج علاء شريف\n" +
                "شارك سمسم شهاب في عدد كبير من الاعمال الفنية علي الشاشتين الصغيرة والكبيرة مثل مسلسل النايت  وكذلك عدد من الافلام منها منها الالماني وسبوبة والشايب ووش سجون.\n" +
                "اشتهر سمسم شهاب بحبه للقراءة وولعه الشديد بكرة القدم حيث عرف عنه حضوره للدورات الرمضانية.\n");
      //  nashaaTxt.setText("طارق الشيخ طارق دلعو عندليب الشعبى وسفير الاحزان (الكروان) من مواليد حى الشرابية السن 39 رصيد الالبومات 9 مع العلم ان البوم راحو ليس من البوماته ومن كليبات طارق عشاق والكل راح وبدور عليكى وسلملى على قلبك واجرح واله الكون ويارب قوينى والحكايه واخر اعماله حتى الان 3 اغانى من مسلسل الحاره وقد اكتشفه الاستاذ المؤلف امل الطاير وطارق الشيخ مع شركه الاصدقاء وقام بعمل دويتو مع عبد الباسط حموده وهو الحب الاولانى وتعامل مع بعض المؤلفين ومنهم مصطفى كامل ومسعد الكومى و امل الطاير وهانى الصغير وغيرهم الكثير وبدا الغناء من حوالى اكثر من 20 عام");
    }


    @Override
    protected void onPause() {
        super.onPause();
        finish();
    }
}
